espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/sdmmc_reg.h
/** SDHOST_IDINTEN_REG register
 *  IDMAC interrupt enable register
 */
#define SDHOST_IDINTEN_REG (DR_REG_SDHOST_BASE + 0x90)
/** SDHOST_IDINTEN_TI : R/W; bitpos: [0]; default: 0;
 *  Transmit Interrupt Enable. When set with Normal Interrupt Summary Enable, Transmit
 *  Interrupt is enabled. When reset, Transmit Interrupt is disabled.
 */
#define SDHOST_IDINTEN_TI    (BIT(0))
#define SDHOST_IDINTEN_TI_M  (SDHOST_IDINTEN_TI_V << SDHOST_IDINTEN_TI_S)
#define SDHOST_IDINTEN_TI_V  0x00000001U
#define SDHOST_IDINTEN_TI_S  0
/** SDHOST_IDINTEN_RI : R/W; bitpos: [1]; default: 0;
 *  Receive Interrupt Enable. When set with Normal Interrupt Summary Enable, Receive
 *  Interrupt is enabled. When reset, Receive Interrupt is disabled.
 */
#define SDHOST_IDINTEN_RI    (BIT(1))
#define SDHOST_IDINTEN_RI_M  (SDHOST_IDINTEN_RI_V << SDHOST_IDINTEN_RI_S)
#define SDHOST_IDINTEN_RI_V  0x00000001U
#define SDHOST_IDINTEN_RI_S  1
/** SDHOST_IDINTEN_FBE : R/W; bitpos: [2]; default: 0;
 *  Fatal Bus Error Enable. When set with Abnormal Interrupt Summary Enable, the Fatal
 *  Bus Error Interrupt is enabled. When reset, Fatal Bus Error Enable Interrupt is
 *  disabled.
 */
#define SDHOST_IDINTEN_FBE    (BIT(2))
#define SDHOST_IDINTEN_FBE_M  (SDHOST_IDINTEN_FBE_V << SDHOST_IDINTEN_FBE_S)
#define SDHOST_IDINTEN_FBE_V  0x00000001U
#define SDHOST_IDINTEN_FBE_S  2
/** SDHOST_IDINTEN_DU : R/W; bitpos: [4]; default: 0;
 *  Descriptor Unavailable Interrupt. When set along with Abnormal Interrupt Summary
 *  Enable, the DU interrupt is enabled.
 */
#define SDHOST_IDINTEN_DU    (BIT(4))
#define SDHOST_IDINTEN_DU_M  (SDHOST_IDINTEN_DU_V << SDHOST_IDINTEN_DU_S)
#define SDHOST_IDINTEN_DU_V  0x00000001U
#define SDHOST_IDINTEN_DU_S  4
/** SDHOST_IDINTEN_CES : R/W; bitpos: [5]; default: 0;
 *  Card Error summary Interrupt Enable. When set, it enables the Card Interrupt
 *  summary.
 */
#define SDHOST_IDINTEN_CES    (BIT(5))
#define SDHOST_IDINTEN_CES_M  (SDHOST_IDINTEN_CES_V << SDHOST_IDINTEN_CES_S)
#define SDHOST_IDINTEN_CES_V  0x00000001U
#define SDHOST_IDINTEN_CES_S  5
/** SDHOST_IDINTEN_NI : R/W; bitpos: [8]; default: 0;
 *  Normal Interrupt Summary Enable. When set, a normal interrupt is enabled. When
 *  reset, a normal interrupt is disabled. This bit enables the following bits:
 *  IDINTEN[0]: Transmit Interrupt;
 *  IDINTEN[1]: Receive Interrupt.
 */
#define SDHOST_IDINTEN_NI    (BIT(8))
#define SDHOST_IDINTEN_NI_M  (SDHOST_IDINTEN_NI_V << SDHOST_IDINTEN_NI_S)
#define SDHOST_IDINTEN_NI_V  0x00000001U
#define SDHOST_IDINTEN_NI_S  8
/** SDHOST_IDINTEN_AI : R/W; bitpos: [9]; default: 0;
 *  Abnormal Interrupt Summary Enable. When set, an abnormal interrupt is enabled. This
 *  bit enables the following bits:
 *  IDINTEN[2]: Fatal Bus Error Interrupt;
 *  IDINTEN[4]: DU Interrupt.
 */
#define SDHOST_IDINTEN_AI    (BIT(9))
#define SDHOST_IDINTEN_AI_M  (SDHOST_IDINTEN_AI_V << SDHOST_IDINTEN_AI_S)
#define SDHOST_IDINTEN_AI_V  0x00000001U
#define SDHOST_IDINTEN_AI_S  9

/** SDHOST_DSCADDR_REG register
 *  Host descriptor address pointer
 */
#define SDHOST_DSCADDR_REG (DR_REG_SDHOST_BASE + 0x94)
/** SDHOST_DSCADDR : RO; bitpos: [31:0]; default: 0;
 *  Host Descriptor Address Pointer, updated by IDMAC during operation and cleared on
 *  reset. This register points to the start address of the current descriptor read by
 *  the IDMAC.
 */
#define SDHOST_DSCADDR    0xFFFFFFFFU
#define SDHOST_DSCADDR_M  (SDHOST_DSCADDR_V << SDHOST_DSCADDR_S)
#define SDHOST_DSCADDR_V  0xFFFFFFFFU
#define SDHOST_DSCADDR_S  0

/** SDHOST_BUFADDR_REG register
 *  Host buffer address pointer register
 */
#define SDHOST_BUFADDR_REG (DR_REG_SDHOST_BASE + 0x98)
/** SDHOST_BUFADDR : RO; bitpos: [31:0]; default: 0;
 *  Host Buffer Address Pointer, updated by IDMAC during operation and cleared on
 *  reset. This register points to the current Data Buffer Address being accessed by
 *  the IDMAC.
 */
#define SDHOST_BUFADDR    0xFFFFFFFFU
#define SDHOST_BUFADDR_M  (SDHOST_BUFADDR_V << SDHOST_BUFADDR_S)
#define SDHOST_BUFADDR_V  0xFFFFFFFFU
#define SDHOST_BUFADDR_S  0

/** SDHOST_CARDTHRCTL_REG register
 *  Card Threshold Control register
 */
#define SDHOST_CARDTHRCTL_REG (DR_REG_SDHOST_BASE + 0x100)
/** SDHOST_CARDRDTHREN_REG : R/W; bitpos: [0]; default: 0;
 *  Card read threshold enable.
 *  1'b0-Card read threshold disabled.
 *  1'b1-Card read threshold enabled.
 */
#define SDHOST_CARDRDTHREN_REG    (BIT(0))
#define SDHOST_CARDRDTHREN_REG_M  (SDHOST_CARDRDTHREN_REG_V << SDHOST_CARDRDTHREN_REG_S)
#define SDHOST_CARDRDTHREN_REG_V  0x00000001U
#define SDHOST_CARDRDTHREN_REG_S  0
/** SDHOST_CARDCLRINTEN_REG : R/W; bitpos: [1]; default: 0;
 *  Busy clear interrupt generation:
 *  1'b0-Busy clear interrypt disabled.
 *  1'b1-Busy clear interrypt enabled.
 */
#define SDHOST_CARDCLRINTEN_REG    (BIT(1))
#define SDHOST_CARDCLRINTEN_REG_M  (SDHOST_CARDCLRINTEN_REG_V << SDHOST_CARDCLRINTEN_REG_S)
#define SDHOST_CARDCLRINTEN_REG_V  0x00000001U
#define SDHOST_CARDCLRINTEN_REG_S  1
/** SDHOST_CARDWRTHREN_REG : R/W; bitpos: [2]; default: 0;
 *  Applicable when HS400 mode is enabled.
 *  1'b0-Card write Threshold disabled.
 *  1'b1-Card write Threshold enabled.
 */
#define SDHOST_CARDWRTHREN_REG    (BIT(2))
#define SDHOST_CARDWRTHREN_REG_M  (SDHOST_CARDWRTHREN_REG_V << SDHOST_CARDWRTHREN_REG_S)
#define SDHOST_CARDWRTHREN_REG_V  0x00000001U
#define SDHOST_CARDWRTHREN_REG_S  2
/** SDHOST_CARDTHRESHOLD_REG : R/W; bitpos: [31:16]; default: 0;
 *  The inside FIFO size is 512,This register is applicable when SDHOST_CARDERTHREN_REG
 *  is set to 1 or SDHOST_CARDRDTHREN_REG set to 1.
 */
#define SDHOST_CARDTHRESHOLD_REG    0x0000FFFFU
#define SDHOST_CARDTHRESHOLD_REG_M  (SDHOST_CARDTHRESHOLD_REG_V << SDHOST_CARDTHRESHOLD_REG_S)
#define SDHOST_CARDTHRESHOLD_REG_V  0x0000FFFFU
#define SDHOST_CARDTHRESHOLD_REG_S  16

/** SDHOST_EMMCDDR_REG register
 *  eMMC DDR register
 */
#define SDHOST_EMMCDDR_REG (DR_REG_SDHOST_BASE + 0x10c)
/** SDHOST_HALFSTARTBIT_REG : R/W; bitpos: [1:0]; default: 0;
 *  Control for start bit detection mechanism duration of start bit.Each bit refers to
 *  one slot.Set this bit to 1 for eMMC4.5 and above,set to 0 for SD applications.For
 *  eMMC4.5,start bit can be:
 *  1'b0-Full cycle.
 *  1'b1-less than one full cycle.
 */
#define SDHOST_HALFSTARTBIT_REG    0x00000003U
#define SDHOST_HALFSTARTBIT_REG_M  (SDHOST_HALFSTARTBIT_REG_V << SDHOST_HALFSTARTBIT_REG_S)
#define SDHOST_HALFSTARTBIT_REG_V  0x00000003U
#define SDHOST_HALFSTARTBIT_REG_S  0
/** SDHOST_HS400_MODE_REG : R/W; bitpos: [31]; default: 0;
 *  Set 1 to enable HS400 mode.
 */
#define SDHOST_HS400_MODE_REG    (BIT(31))
#define SDHOST_HS400_MODE_REG_M  (SDHOST_HS400_MODE_REG_V << SDHOST_HS400_MODE_REG_S)
#define SDHOST_HS400_MODE_REG_V  0x00000001U
#define SDHOST_HS400_MODE_REG_S  31

/** SDHOST_ENSHIFT_REG register
 *  Enable Phase Shift register
 */
#define SDHOST_ENSHIFT_REG (DR_REG_SDHOST_BASE + 0x110)
/** SDHOST_ENABLE_SHIFT_REG : R/W; bitpos: [3:0]; default: 0;
 *  Control for the amount of phase shift provided on the default enables in the
 *  design.Two bits assigned for each card.
 *  2'b00-Default phase shift.
 *  2'b01-Enables shifted to next immediate positive edge.
 *  2'b10-Enables shifted to next immediate negative edge.
 *  2'b11-Reserved.
 */
#define SDHOST_ENABLE_SHIFT_REG    0x0000000FU
#define SDHOST_ENABLE_SHIFT_REG_M  (SDHOST_ENABLE_SHIFT_REG_V << SDHOST_ENABLE_SHIFT_REG_S)
#define SDHOST_ENABLE_SHIFT_REG_V  0x0000000FU
#define SDHOST_ENABLE_SHIFT_REG_S  0

